Tekla Open API Reference for Tekla Structures 2025
CannotSetAttributeForPluginDueToInexistantFieldException Class
 The CannotSetAttributeForPluginDueToInexistantFieldException class defines the exception that is thrown when Plugin.SetAttribute is called but the field does not exist.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToInexistantFieldException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotSetAttributeForPluginDueToInexistantFieldException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotSetAttributeForPluginDueToInexistantFieldException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotSetAttributeForPluginDueToInexistantFieldException type exposes the following members.
Constructors
Name | Description
CannotSetAttributeForPluginDueToInexistantFieldException
 Creates a new CannotSetAttributeForPluginDueToInexistantFieldException instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace